// alert 메세지
export const ERROR_MESSAGE = {
  EMPTY: '"[필수]" 설정 값을 전부 설정해주셔야 실행됩니다.'
}

// placeholder 메세지
export const PLACEHOLDER = {
  title: '전략 이름을 입력해주세요.',
  algorithm: '전략배분 (정적자산배분)',
  cycleRebalancing: '주기 리밸런싱을 선택해주세요.',
  bandRebalancing: '밴드 리밸런싱 기준을 입력해주세요.',
  initialInvestmentAmount: '초기 투자 금액을 입력해주세요.',
  marketIndex: 'S&P 500'
}

// 범위 안내 메세지
export const RANGE_MESSAGE = {
  zeroToHundred: '0 ~ 100까지 입력할 수 있습니다. (0 입력시 비활성화)',
  oneToHundred: '1 ~ 100까지 입력할 수 있습니다.',
  oneToFive: '1 ~ 5까지 입력할 수 있습니다.',
  fiveToTwoHundred: '5 ~ 200까지 입력할 수 있습니다.'
}

// 툴팁 메세지
export const TOOLTIP_MESSAGE = {
  momentum:
    '시장이 상승 추세일 때 투자를 진행하고 하락 주세일 때 현금화를 진행하여 손실을 마켓타이밍 알고리즘입니다.\n다양한 시장 인덱스의 가격 및 변동성 기반의 가격 채널을 통해 추세를 판별합니다.',
  reentry:
    '해당 전략의 수익률 N일 이격도를 기준으로 손절 및 재진입 로직이 적용됩니다. (실전 투자 진행 시 자동 적용됩니다.)',
  baseLine:
    '가격 채녈의 기준이 되는 수익곡선 입니다. 해당 기준선을 기준으로 상단 밴드와 하단 밴드가 결정됩니다.',
  boundaryLine:
    '기준선을 기반으로 가격과 변동성을 기반으로 계산된 수익곡선의 가중치를 부여하여 상/하단 밴드를 생성합니다.\n경계선과 종가의 가격을 통해 상승 추세와 하락 추세를 판별하여 마켓타이밍 시그널을 생성합니다.',
  entryWeight:
    '높을수록 진입 기준이 높아져 매수 진입이 신중해지며 매매 횟수가 줄어들게 됩니다.\n다만 너무 큰 진입 가중치는 적절한 매수 타이밍을 놓칠 수 있습니다.\n반대로 낮을 시 진입 기준이 완화되어 쉽게 매수하게 되어 매매 횟수가 늘어나 매매 수수료 및 슬리피지로 인한 손실이 커질 수 있습니다.',
  liquidationWeight:
    '높을수록 청산 기준이 높아져 매도가 신중해지며 매매 횟수가 줄어듭니다.\n다만 너무 큰 진입 가중치는 적절한 매도 타이밍을 놓칠 수 있습니다.\n반대로 낮을 시 청산 기준이 완화되어 매도가 쉬워지며 매매 횟수가 늘어나 매매 수수료 및 슬리피지로 인한 손실이 커질 수 있습니다.',
  sma: '단순 이동평균선 이격도를 이용해 손절 및 재진입 로직이 적용됩니다.',
  ema: '지수 이동평균선 이격도를 이용해 손절 및 재진입 로직이 적용됩니다.',
  hma: 'HULL 이동평균선 이격도를 이용해 손절 및 재진입 로직이 적용됩니다.'
}
